src/cf/Catalogs/ШаблоныДвухфакторнойАутентификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныДвухфакторнойАутентификации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодHTTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКонтейнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФактическиеУчастники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ШаблоныДвухфакторнойАутентификации/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьШаблоныИзБазыДанных(Команда)
	ПрочитатьШаблоныИзБазыДанныхНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсеНастройкиДвухфакторнойАутентификации(Команда)
	Оповещение = Новый ОписаниеОповещения("ОчиститьВсеНастройкиДвухфакторнойАутентификацииПродолжение",
		ЭтотОбъект);
		
	ПоказатьВопрос(Оповещение,
		НСтр("ru='Все шаблоны будут помечены на удаление, а у пользователей информационной базы будут очищены оставшиеся настройки двухфакторной аутентификации. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьВсеНастройкиДвухфакторнойАутентификацииПродолжение(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьВсеНастройкиДвухфакторнойАутентификацииНаСервере();
	КонецЕсли;
КонецПроцедуры

// Считывает шаблоны 2ФА из ИБ, и на их основании создает шаблоны 2ФА в справочнике
&НаСервере
Процедура ПрочитатьШаблоныИзБазыДанныхНаСервере()
	
	Шаблоны = ШаблоныНастроекВторогоФактораАутентификации.ПолучитьШаблоны();
	
	Для Каждого Шаблон Из Шаблоны Цикл
		НайденныйШаблон = Справочники.ШаблоныДвухфакторнойАутентификации.НайтиПоНаименованию(Шаблон.Имя);
		Если НайденныйШаблон.Пустая() Тогда
			НовыйШаблон = Справочники.ШаблоныДвухфакторнойАутентификации.СоздатьЭлемент();
			НовыйШаблон.Наименование = Шаблон.Имя;
			НовыйШаблон.МетодHTTP = Шаблон.МетодHTTPЗапросаНаАутентификацию;
			НовыйШаблон.АдресРесурса = Шаблон.HTTPЗапросНаАутентификацию.АдресРесурса;
			
			// Создадим параметр &secret
			НовыйПараметр = НовыйШаблон.Параметры.Добавить();
			НовыйПараметр.ИмяПараметра = "secret_code";
			НовыйПараметр.ЗначениеПараметра = "&secret";

			НовыйШаблон.Записать();
		Иначе
			Сообщение = СтрШаблон(НСтр("ru='Шаблон с наименованием ""%1"" уже существует'"), Шаблон.Имя);
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Помечает на удаление все шаблоны 2ФА, после чего очищает все оставшиеся настройки у пользователей ИБ
&НаСервере
Процедура ОчиститьВсеНастройкиДвухфакторнойАутентификацииНаСервере()

	Справочники.ШаблоныДвухфакторнойАутентификации.ОчиститьВсеНастройкиДвухфакторнойАутентификации();
	
КонецПроцедуры

#КонецОбласти
